CodeKill3r/CDJ-100S-STM32F7-Display/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "dma.h"
#include "dma2d.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "sai.h"
#include "sdmmc.h"
#include "spi.h"
#include "tim.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <wchar.h>
#include "rekordbox.h"
#include "display.h"
#include "mp3dec.h"
#include "stm32746g_discovery_audio.h"
#include "stm32746g_discovery_ts.h"
#include "waveplayer.h"
#include "mp3player.h"
#include "ff.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
uint8_t ActiveLayer = 0;
int Track_number = 0;
FATFS SDFatFs;  /* File system object for SD card logical drive */
FATFS USBHFatFs;  /* File system object for USB_Host logical drive */
FIL MyFile;     /* File object */
extern char SDPath[4]; /* SD card logical drive path */
extern char USBHPath[4]; /* USB Host logical drive path */
//extern ApplicationTypeDef Appli_HS_state;
extern ApplicationTypeDef Appli_FS_state;
FRESULT res;
DIR dir;
static FILINFO fno;
TCHAR new_path[255] = {0};
TCHAR old_path[255] = {0};
uint16_t bytesread = 0;
uint32_t file_pos = 0;
uint32_t file_pos_wide = 0;
extern volatile int32_t position;
uint8_t lowp_wavebuffer[400];
extern RekordboxTypeDef rekordbox;
extern DisplayTypeDef display;
uint16_t Total_tracks = 0;
char TrackTable[MAXTOTALTRACKS][255];
char TrackPaths[MAXTOTALTRACKS][255];
int8_t halffr = 0;
int16_t fr = 0;
int8_t sec = 0;
int8_t min = 0;
int16_t rfr = 0;
int8_t rsec = 0;
int8_t rmin = 0;
uint8_t tim7_flag = 0;
extern int8_t menu_mode;
extern int beat;
extern int bar;

//volatile uint16_t* lcdLocFramebuffer0; //[400*272];
//volatile uint16_t* lcdLocFramebuffer1; //[400*272];
//uint8_t* waveBuffer;  //[MAX_WAVESIZE];

uint8_t spi_tx[4] = {0x08, 0x90, 0xFF, 0x00};
uint8_t spi_rx[4] = {0};

TrackTypeDef trak;

HMP3Decoder	hMP3Decoder;

TS_StateTypeDef ts_State;

AUDIO_OUT_BufferTypeDef BufferCtl;

volatile UINT bOutOfData = 0;
volatile uint32_t unDmaBufMode = 0;
uint8_t volume = 60;
uint8_t acue_sensitivity = 30;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
void MX_USB_HOST_Process(FATFS* USBHfs, TCHAR const* USBHPath);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
FRESULT scan_files();
FRESULT find_file(uint16_t track_number);

/* USER CODE END PFP */


/*************************************
 *
 *
 * ***************
 * *** FIXED  ****
 * ***************
 *
 * setting WCHAR (src alias for TCHAR) to 'unsigned int' WORKS!   (instead of 'unsigned short')
 * in ' Middleware/Third_Party/Fatfs/src/integer.h '
 *
 * ********************
 *
 *  wchar problems with and without compiler flags: -fshort-wchar
 *
 *  without constructors create UTF32 wchars /  L"text" == _T("text")   /  also, the 32bit TCHARs are not compatible with the FATFS functions
 *
 *  with the flags the constructors are UTF16 but the wcscpy / wcscat still UTF32 (linked from prebuild toolchain) and messes up the memory
 *
 *
 ********************************/


/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_LTDC_Init();
  MX_FMC_Init();
  MX_SDMMC1_SD_Init();
  MX_FATFS_Init();
  MX_DMA2D_Init();
  MX_SAI2_Init();
  MX_I2C3_Init();
  MX_TIM4_Init();
  MX_TIM6_Init();
  MX_TIM7_Init();
  MX_TIM8_Init();
  MX_SPI2_Init();
  MX_TIM5_Init();
  MX_TIM9_Init();
  /* USER CODE BEGIN 2 */
  SDRAM_Init(); // MT48LC4M32B2B5-6A SDRAM initialization
  menu_mode=3;

  HAL_LTDC_SetAddress(&hltdc, LCD_FB_START_ADDRESS_0, 0); // set layer 0 framebuffer address
  HAL_LTDC_SetAddress(&hltdc, LCD_FB_START_ADDRESS_1, 1); // set layer 1 framebuffer address
     //HAL_LTDC_SetAddress(&hltdc, (uint32_t)lcdLocFramebuffer0, 0); // set layer 0 framebuffer address
     //HAL_LTDC_SetAddress(&hltdc, (uint32_t)lcdLocFramebuffer1, 1); // set layer 1 framebuffer address
  ClearLayer(); // clear framebuffer 0
  BSP_LCD_DisplayOn();


  MX_USB_HOST_Init();

  HAL_TIM_Base_Start_IT(&htim4); // start display refresh timer

  HAL_LTDC_SetAlpha_NoReload(&hltdc, 0, ActiveLayer++);
  HAL_LTDC_SetAlpha_NoReload(&hltdc, 255, ActiveLayer--);
  ChangeLayers();
  ClearLayer(); // clear framebuffer 1
  dbgAddText("pre init");

  MX_USB_HOST_Process(&USBHFatFs, (const TCHAR*)USBHPath);
 // while(1){}; //HALT

  dbgAddText("host init");
  while(((BSP_SD_IsDetected() != SD_PRESENT))&&(Appli_FS_state != APPLICATION_READY)){   //&&(Appli_FS_state != APPLICATION_START))   {
	  menu_mode = 3;
	  BSP_LCD_DisplayOn();
	  MX_USB_HOST_Process(&USBHFatFs, (const TCHAR*)USBHPath);
	  //HAL_Delay(2000);
  }
  dbgAddText("post usb");

  BSP_TS_Init(480, 272); // touchscreen initialization
  BSP_TS_ITClear();
  BSP_TS_ITConfig();
  if (BSP_SD_IsDetected() == SD_PRESENT){
	  dbgAddText("sd present");
  	  f_mount(&SDFatFs, (const TCHAR*)SDPath, 0); // SD card disk mount
  }
  else if ((Appli_FS_state != APPLICATION_READY)) //&& (Appli_FS_state != APPLICATION_START))   //shouldn't be true if it got here, but just to be safe  --- USB already mounts
  {
	  menu_mode = 3;
	  BSP_LCD_DisplayOn();
	  MX_USB_HOST_Process(&USBHFatFs, (const TCHAR*)USBHPath);
	  dbgAddText("usb halt");
	  while(1);
  }
  else if (Appli_FS_state == APPLICATION_READY)	//mount USB
  {
  	  f_mount(&USBHFatFs, (const TCHAR*)USBHPath, 0); // USB disk mount
  }

  hMP3Decoder = MP3InitDecoder(); // mp3 decoder initialization

  dbgAddText("pre scan");
  scan_files(); // get total track number
  dbgAddText("post scan");

  HAL_TIM_Base_Start_IT(&htim5); // start jog speed counting timer
  HAL_SPI_TransmitReceive_IT(&hspi2, spi_tx, spi_rx, 4);
  BSP_AUDIO_OUT_Init(OUTPUT_DEVICE_HEADPHONE, volume, (uint32_t)(AUDIO_FREQUENCY_22K)*(1 + trak.percent));
  BSP_AUDIO_OUT_SetVolume(0);
  BSP_LCD_DisplayOn();
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  find_file(Track_number);
	  fr = 0;
	  sec = 0;
	  min = 0;
	  rfr = 0;
	  rsec = 0;
	  rmin = 0;
	  file_pos_wide = 0;
	  position = 0;
	  rekordbox.state = 0;
	  display.loop = 0;
	  if(display.cuemode == 1) rekordbox.autocue = 1;
	  else rekordbox.autocue = 0;
	  rekordbox.currentcue = 0;
	  DecodeRekordboxFiles(new_path);
	  menu_mode = 0;
	  bar = 0;
	  beat = 0;
	  res = f_open(&MyFile, rekordbox.filename, FA_READ);
	  if(res == FR_OK)
	  {
		  trak.state = PLAYING;
		  spi_tx[2] &= ~(1 << 0);
		  if(rekordbox.autocue == 2) spi_tx[2] &= ~(1 << 1);
		  else spi_tx[2] |= (1 << 1);
		  spi_tx[2] &= ~(1 << 3);
		  if((strcmp(rekordbox.filetype, ".wav") == 0) || (strcmp(rekordbox.filetype, ".WAV") == 0)) {
			  PlayWavFile();
		  }
		  if((strcmp(rekordbox.filetype, ".mp3") == 0) || (strcmp(rekordbox.filetype, ".MP3") == 0)) {
			  PlayMp3File();
		  }
		  spi_tx[2] |= (1 << 3);
		  trak.state = STOPPED;
		  BSP_AUDIO_OUT_Stop(CODEC_PDWN_SW);
	  }
	  if(file_pos_wide >= rekordbox.spectrum_size) {
		  Track_number++;
	  }
	  file_pos_wide = 0;
	  menu_mode = 4;
	  f_close(&MyFile);
	  f_closedir(&dir);
	  if(Track_number >= Total_tracks) Track_number = 0;
	  if(Track_number < 0) Track_number = Total_tracks - 1;

	  MX_USB_HOST_Process(&USBHFatFs, (const TCHAR*)USBHPath);
  }
    /* USER CODE END WHILE */
  MX_USB_HOST_Process(&USBHFatFs, (const TCHAR*)USBHPath);

    /* USER CODE BEGIN 3 */

  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 400;//384;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 8;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }

  /* Select PLLSAI output as USB clock source */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_CLK48;
  PeriphClkInitStruct.Clk48ClockSelection = RCC_CLK48SOURCE_PLLSAIP;
  PeriphClkInitStruct.PLLSAI.PLLSAIN = 192;
  PeriphClkInitStruct.PLLSAI.PLLSAIQ = 4;
  PeriphClkInitStruct.PLLSAI.PLLSAIP = RCC_PLLSAIP_DIV4;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
   * clocks dividers */
  RCC_ClkInitStruct.ClockType =
    (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 |
     RCC_CLOCKTYPE_PCLK2);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_6) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
FRESULT scan_files()
{
    DIR folder;
    UINT i = 0;
    UINT folders = 0;
    UINT subfolders = 0;
    TCHAR relative_path[255] = {0};
    //TCHAR pio_dir[20] = {0};
    //wcscpy(pio_dir,L"/PIONEER/USBANLZ/"+'\0'+'\0');
    while(1) {
    	res = f_opendir(&folder, L"/PIONEER/USBANLZ");	/* Open the directory */
    	if (res != FR_OK) {
    		break;	/* Break on error or no dir */
    	}
    	i = 0;
    	do {
    		res = f_readdir(&folder, &fno);	/* Read a new, unknown directory item */
    	}while(i++ < folders);

    	if ((res != FR_OK) || (fno.fname[0] == '\0') || (Total_tracks>=MAXTOTALTRACKS)) {
    		f_closedir(&folder);
    		break;	/* Break on error or end of dir */
    	}
    	if (fno.fattrib & AM_DIR) {	/* It is a directory */
    		folders++;
    		for(i = 0; i < 255; i++) new_path[i] = 0;		//clr new_path
    		wcscpy(new_path, L"/PIONEER/USBANLZ/");

    		for(i = 0; i < 255; i++) relative_path[i] = 0;	//clr rel_path
    		wcscpy(relative_path, fno.fname);				//rel_path= [directory]

    		wcscat(new_path, relative_path);					//step in new_path=  /PIONEER/USBANLZ/ + [directory]
    		wcscpy(old_path, new_path);						//old_path=new_path
    		f_closedir(&folder);
    		subfolders = 0;
    		while(1) {
    			res = f_opendir(&folder, old_path);			//we have to go deeper
    			for(i = 0; i < 255; i++) new_path[i] = 0;	//clr new_path
    			wcscpy(new_path, old_path);					//re-use new_path=  /PIONEER/USBANLZ/ + [directory]
    			i = 0;
    			do {
    				res = f_readdir(&folder, &fno);	/* Read a new directory item */
    			}while(i++ < subfolders);

    			if ((res != FR_OK) || (fno.fname[0] == '\0') || (Total_tracks>=MAXTOTALTRACKS)) {
    				f_closedir(&folder);
    				break;  /* Break on error or end of dir */
    			}
    			if (fno.fattrib & AM_DIR) {	/* It is a directory */
    				subfolders++;
    				wcscat(new_path, L"/");
    				wcscat(new_path, fno.fname);			// new_path=  /PIONEER/USBANLZ/ + [directory] + /[subdir]
    				//wcscat(relative_path, L"/");
    				//wcscat(relative_path, fno.fname);		// rel_path= [directory] + /[subdir]
    				f_closedir(&folder);
    				res = f_opendir(&folder, new_path);		//one more level deeper
    				if(res == FR_OK) {
    					res = f_readdir(&folder, &fno);		//there should be files!
    					if (!(fno.fattrib & AM_DIR)) {
    						for(i=0; i<255; i++) TrackPaths[Total_tracks][i] = ff_convert(new_path[i], 0);		//populate database
    						wcscat(new_path, L"/");
    						wcscat(new_path, fno.fname);			//one of the files --- does not matter -- all starts with the main header then the mediafile
    						if (GetFileName(new_path)==0)		//filename OK -- otherwise tracknumber overwritten with usable one (hopefully)
    						{
    							for(i = 0; i < 255; i++) TrackTable[Total_tracks][i] = rekordbox.file[i];
    							Total_tracks++;
    						}
							f_closedir(&folder);
    					}
    				}
    			}
    		}
    	}
    }
    return res;
}

FRESULT find_file(uint16_t track_number)
{
    DIR folder;
    TCHAR path[255] = {0};
    for(int i=0; i<255; i++) path[i] = ff_convert(TrackPaths[Track_number][i], 1);
    wcscpy(new_path, path);
	res = f_opendir(&folder, new_path);
	if(res == FR_OK) {
		res = f_readdir(&folder, &fno);
		if (!(fno.fattrib & AM_DIR)) {
		}
	}
    return res;
}

/* USER CODE END 4 */

/* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Disables the MPU */
  HAL_MPU_Disable();


  /* Configure the MPU as Strongly ordered for not defined regions */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x00;
  MPU_InitStruct.Size = MPU_REGION_SIZE_4GB;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x87;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Configure the MPU attributes for SDRAM as WT */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0xC0000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_8MB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Configure the MPU attributes FMC control registers */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0xA0000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_8KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);


  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
